Edlward/STM32CubeMX_ProjectTest/uart1Time20707/Application/Communication/src/respond_gimbal_cmd.c
	float		f_sensor_acc_offset_data_array_backup[3];
	float		f_sensor_acc_scale_data_array_backup[3];
		
	uint8_t	uc_fdb_cmd_data_array_p[3];
	
	static	User_Timer_Typedef	st_this_function_period_timer_p = USER_TIMER_INIT_VALUE;
	
	Start_User_Timer(&st_this_function_period_timer_p);
	Update_User_Timer_Cnt(&st_this_function_period_timer_p);
	if(st_this_function_period_timer_p.ul_timer_cnt > GIMBAL_CAL_LOOP_PERIOD_MS)   //5ms校准一次
	{	
		Reset_User_Timer(&st_this_function_period_timer_p);
	
		/*---------------------陀螺校准过程---------------------------------*/
		if(SET == en_gimbal_cal_gyro_drift_flag)
		{
			if(SET == Average_Filter_Float(f_sensor_gyro_raw_data_array,f_sensor_gyro_offset_data_array_backup,&uc_gimbal_gyro_flt_cycle_index,100))
			{	
				en_gimbal_cal_gyro_drift_flag = RESET;
		
				/*校准是否通过的标志*/
				if(	(fabs(f_sensor_gyro_offset_data_array_backup[0]) < 20)&&
						(fabs(f_sensor_gyro_offset_data_array_backup[1]) < 20)&&
						(fabs(f_sensor_gyro_offset_data_array_backup[2]) < 20)&&
						(fabs(f_sensor_gyro_raw_data_array[0] - f_sensor_gyro_offset_data_array_backup[0]) < 1)&&
						(fabs(f_sensor_gyro_raw_data_array[1] - f_sensor_gyro_offset_data_array_backup[1]) < 1)&&
						(fabs(f_sensor_gyro_raw_data_array[2] - f_sensor_gyro_offset_data_array_backup[2]) < 1)	)
				{
					f_sensor_gyro_offset_data_array[0] = -f_sensor_gyro_offset_data_array_backup[0];
					f_sensor_gyro_offset_data_array[1] = -f_sensor_gyro_offset_data_array_backup[1];
					f_sensor_gyro_offset_data_array[2] = -f_sensor_gyro_offset_data_array_backup[2];
					
					uc_gimbal_cal_ok_item = uc_gimbal_cal_ok_item|GIMBAL_CAL_ITEM_GYRO_OK;
					//Save_Gimbal_Config_Data();
				}
				else
				{
					uc_gimbal_cal_ok_item = uc_gimbal_cal_ok_item&(~GIMBAL_CAL_ITEM_GYRO_OK);
				}
				
				
				uc_fdb_cmd_data_array_p[0] = 0x57;
				uc_fdb_cmd_data_array_p[1] = 0x20;
				Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
			}
		}
		
		/*----------------------加速度校准过程---------------------------------*/
		if(SET == en_gimbal_cal_acc_drift_flag)
		{
			switch(uc_gimbal_cal_acc_drift_step)
			{
				case 0x02:  //gimbal_x轴=sensor_z
						if(SET == Average_Filter_Float(f_sensor_acc_raw_data_array,f_sensor_acc_mean_data_array_p,&uc_gimbal_acc_flt_cycle_index,100))
						{				
							gimbal_acc_x_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_X_DATA_INDEX];
							gimbal_acc_y_at_x_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Y_DATA_INDEX];
							gimbal_acc_z_at_x_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Z_DATA_INDEX];
							
							//反馈x校准完成
							uc_fdb_cmd_data_array_p[0] = 0x56;
							uc_fdb_cmd_data_array_p[1] = 0x11;
							uc_fdb_cmd_data_array_p[2] = 0x02;
							Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
							
							/*当前步校准完成*/
							en_gimbal_cal_acc_drift_flag = RESET;
						}
						break;
				case 0x03://gimbal_x轴=sensor_z
						if(SET == Average_Filter_Float(f_sensor_acc_raw_data_array,f_sensor_acc_mean_data_array_p,&uc_gimbal_acc_flt_cycle_index,100))
						{
							gimbal_acc_x_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_X_DATA_INDEX];
							gimbal_acc_y_at_x_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Y_DATA_INDEX];
							gimbal_acc_z_at_x_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Z_DATA_INDEX];
							
							//反馈x校准完成
							uc_fdb_cmd_data_array_p[0] = 0x56;
							uc_fdb_cmd_data_array_p[1] = 0x11;
							uc_fdb_cmd_data_array_p[2] = 0x03;
							Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
							
							/*当前步校准完成*/
							en_gimbal_cal_acc_drift_flag = RESET;
						}
						break;
				case 0x04://gimbal_y轴=sensor_x
						if(SET == Average_Filter_Float(f_sensor_acc_raw_data_array,f_sensor_acc_mean_data_array_p,&uc_gimbal_acc_flt_cycle_index,100))
						{
							gimbal_acc_y_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Y_DATA_INDEX];
							gimbal_acc_x_at_y_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_X_DATA_INDEX];
							gimbal_acc_z_at_y_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Z_DATA_INDEX];				
							
							//反馈x校准完成
							uc_fdb_cmd_data_array_p[0] = 0x56;
							uc_fdb_cmd_data_array_p[1] = 0x11;
							uc_fdb_cmd_data_array_p[2] = 0x04;
							Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
							
							/*当前步校准完成*/
							en_gimbal_cal_acc_drift_flag = RESET;
						}
						break;
				case 0x05://gimbal_y轴=sensor_x
						if(SET == Average_Filter_Float(f_sensor_acc_raw_data_array,f_sensor_acc_mean_data_array_p,&uc_gimbal_acc_flt_cycle_index,100))
						{
							gimbal_acc_y_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Y_DATA_INDEX];
							gimbal_acc_x_at_y_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_X_DATA_INDEX];
							gimbal_acc_z_at_y_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Z_DATA_INDEX];
							
							
							//反馈x校准完成
							uc_fdb_cmd_data_array_p[0] = 0x56;
							uc_fdb_cmd_data_array_p[1] = 0x11;
							uc_fdb_cmd_data_array_p[2] = 0x05;
							Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
							
							/*当前步校准完成*/
							en_gimbal_cal_acc_drift_flag = RESET;
						}
						break;
				case 0x06://gimbal_z轴=sensor_y
						if(SET == Average_Filter_Float(f_sensor_acc_raw_data_array,f_sensor_acc_mean_data_array_p,&uc_gimbal_acc_flt_cycle_index,100))
						{
							gimbal_acc_z_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Z_DATA_INDEX];
							gimbal_acc_x_at_z_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_X_DATA_INDEX];
							gimbal_acc_y_at_z_max = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Y_DATA_INDEX];
							
							//反馈x校准完成
							uc_fdb_cmd_data_array_p[0] = 0x56;
							uc_fdb_cmd_data_array_p[1] = 0x11;
							uc_fdb_cmd_data_array_p[2] = 0x06;
							Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
							
							/*当前步校准完成*/
							en_gimbal_cal_acc_drift_flag = RESET;
						}
						break;
				case 0x07://gimbal_z轴=sensor_y
						if(SET == Average_Filter_Float(f_sensor_acc_raw_data_array,f_sensor_acc_mean_data_array_p,&uc_gimbal_acc_flt_cycle_index,100))
						{
							gimbal_acc_z_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Z_DATA_INDEX];
							gimbal_acc_x_at_z_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_X_DATA_INDEX];
							gimbal_acc_y_at_z_min = f_sensor_acc_mean_data_array_p[GIMBAL_ACC_Y_DATA_INDEX];
							
							//计算加速度偏移
							f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX] = -(gimbal_acc_x_max + gimbal_acc_x_min)/2;
							f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX] = -(gimbal_acc_y_max + gimbal_acc_y_min)/2;
							f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX] = -(gimbal_acc_z_max + gimbal_acc_z_min)/2;
							
							//计算加速度灵敏度，并将scale值限定在0.8～1.2的范围内
							//加速度偏置需在±0.3g之内
							if(	(fabs(f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX]) < 0.3)&&
									(fabs(f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX]) < 0.3)&&
									(fabs(f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX]) < 0.3)&&
									(fabs(gimbal_acc_x_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX]) > 0.8)&&(fabs(gimbal_acc_x_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX]) < 1.2)&&
									(fabs(gimbal_acc_y_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX]) > 0.8)&&(fabs(gimbal_acc_y_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX]) < 1.2)&&
									(fabs(gimbal_acc_z_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX]) > 0.8)&&(fabs(gimbal_acc_z_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX]) < 1.2)
								)
							{
								f_sensor_acc_scale_data_array_backup[GIMBAL_ACC_X_DATA_INDEX] = 1.f/fabs(gimbal_acc_x_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX]);
								f_sensor_acc_scale_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX] = 1.f/fabs(gimbal_acc_y_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX]);
								f_sensor_acc_scale_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX] = 1.f/fabs(gimbal_acc_z_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX]);
								
								f_sensor_acc_scale_data_array[0] = f_sensor_acc_scale_data_array_backup[0];
								f_sensor_acc_scale_data_array[1] = f_sensor_acc_scale_data_array_backup[1];
								f_sensor_acc_scale_data_array[2] = f_sensor_acc_scale_data_array_backup[2];
								
								uc_gimbal_cal_ok_item = uc_gimbal_cal_ok_item|GIMBAL_CAL_ITEM_ACC_SCALE_OK;
							}
							
							
