Edlward/STM32CubeMX_ProjectTest/uart1Time20707/Application/Communication/src/respond_gimbal_cmd.c
							/*在scale是正确的后，才能继续判断*/
							if(uc_gimbal_cal_ok_item&GIMBAL_CAL_ITEM_ACC_SCALE_OK)
							{
								//判断x_max校准时是否水平
								gimbal_acc_y_at_x_max = (gimbal_acc_y_at_x_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Y_DATA_INDEX];
								gimbal_acc_z_at_x_max = (gimbal_acc_z_at_x_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Z_DATA_INDEX];
								
								if( (fabs(gimbal_acc_y_at_x_max) < 0.1)&&(fabs(gimbal_acc_z_at_x_max) < 0.1) )
								{
									gimbal_acc_x_max_cal_ok_flag = SET;
								}
								else
								{
									gimbal_acc_x_max_cal_ok_flag = RESET;
								}
								
								//判断x_min校准时是否水平
								gimbal_acc_y_at_x_min = (gimbal_acc_y_at_x_min + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Y_DATA_INDEX];
								gimbal_acc_z_at_x_min = (gimbal_acc_z_at_x_min + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Z_DATA_INDEX];
								
								if( (fabs(gimbal_acc_y_at_x_min) < 0.1)&&(fabs(gimbal_acc_z_at_x_min) < 0.1) )
								{
									gimbal_acc_x_min_cal_ok_flag = SET;
								}
								else
								{
									gimbal_acc_x_min_cal_ok_flag = RESET;
								}
								
								
								//判断y_max校准时是否水平
								gimbal_acc_x_at_y_max = (gimbal_acc_x_at_y_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_X_DATA_INDEX];
								gimbal_acc_z_at_y_max = (gimbal_acc_z_at_y_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Z_DATA_INDEX];
								
								if( (fabs(gimbal_acc_x_at_y_max) < 0.1)&&(fabs(gimbal_acc_z_at_y_max) < 0.1) )
								{
									gimbal_acc_y_max_cal_ok_flag = SET;
								}
								else
								{
									gimbal_acc_y_max_cal_ok_flag = RESET;
								}
								
								//判断y_min校准时是否水平
								gimbal_acc_x_at_y_min = (gimbal_acc_x_at_y_min + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_X_DATA_INDEX];
								gimbal_acc_z_at_y_min = (gimbal_acc_z_at_y_min + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Z_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Z_DATA_INDEX];
								
								if( (fabs(gimbal_acc_x_at_y_min) < 0.1)&&(fabs(gimbal_acc_z_at_y_min) < 0.1) )
								{
									gimbal_acc_y_min_cal_ok_flag = SET;
								}
								else
								{
									gimbal_acc_y_min_cal_ok_flag = RESET;
								}
							
							
								//判断z_max校准时是否水平
								gimbal_acc_x_at_z_max = (gimbal_acc_x_at_z_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_X_DATA_INDEX];
								gimbal_acc_y_at_z_max = (gimbal_acc_y_at_z_max + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Y_DATA_INDEX];
								
								if( (fabs(gimbal_acc_x_at_z_max) < 0.1)&&(fabs(gimbal_acc_y_at_z_max) < 0.1) )
								{
									gimbal_acc_z_max_cal_ok_flag = SET;
								}
								else
								{
									gimbal_acc_z_max_cal_ok_flag = RESET;
								}
							
								//判断z_min校准时是否水平
								gimbal_acc_x_at_z_min = (gimbal_acc_x_at_z_min + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_X_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_X_DATA_INDEX];
								gimbal_acc_y_at_z_min = (gimbal_acc_y_at_z_min + f_sensor_acc_offset_data_array_backup[GIMBAL_ACC_Y_DATA_INDEX])*f_sensor_acc_scale_data_array[GIMBAL_ACC_Y_DATA_INDEX];
								
								if( (fabs(gimbal_acc_x_at_z_min) < 0.1)&&(fabs(gimbal_acc_y_at_z_min) < 0.1) )
								{
									gimbal_acc_z_min_cal_ok_flag = SET;
								}
								else
								{
									gimbal_acc_z_min_cal_ok_flag = RESET;
								}
													
								/*判断加速度校准是否正确*/
								if(	(SET == gimbal_acc_x_max_cal_ok_flag)&&(SET == gimbal_acc_x_min_cal_ok_flag)&&
										(SET == gimbal_acc_y_max_cal_ok_flag)&&(SET == gimbal_acc_y_min_cal_ok_flag)&&
										(SET == gimbal_acc_z_max_cal_ok_flag)&&(SET == gimbal_acc_z_min_cal_ok_flag) )
								{
									uc_gimbal_cal_ok_item = uc_gimbal_cal_ok_item|GIMBAL_CAL_ITEM_ACC_OK;
									
									f_sensor_acc_offset_data_array[0] = f_sensor_acc_offset_data_array_backup[0];		
									f_sensor_acc_offset_data_array[1] = f_sensor_acc_offset_data_array_backup[1];
									f_sensor_acc_offset_data_array[2] = f_sensor_acc_offset_data_array_backup[2];
								}
							}
							
							
							/*校准通过,保存数据*/
							if(uc_gimbal_cal_ok_item|GIMBAL_CAL_ITEM_ACC_OK|GIMBAL_CAL_ITEM_ACC_SCALE_OK)
							{
									 ;//Save_Gimbal_Config_Data();
							}	
							
							//反馈x校准完成
							uc_fdb_cmd_data_array_p[0] = 0x56;
							uc_fdb_cmd_data_array_p[1] = 0x11;
							uc_fdb_cmd_data_array_p[2] = 0x07;
							Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
							
							/*当前步校准完成*/
							en_gimbal_cal_acc_drift_flag = RESET;						
						}
						break;
				
			}
		}
	}
	
	/*调试模式下不断反馈状态信息*/
	if(SET == en_gimbal_enter_debug_mode_flag)
	{
		Feedback_Debug_Information();
	}
		
}






/**
  * @brief 	void Feedback_Debug_Information(void)
	* @note	 	调试状态下反馈调试信息
  */
void Feedback_Debug_Information(void)
{
	uint8_t	uc_fdb_cmd_data_array_p[18];
	static	FlagStatus	Feedback_Odd_Flag = SET;
	
	static	User_Timer_Typedef	st_this_function_period_timer_p = USER_TIMER_INIT_VALUE;
	Start_User_Timer(&st_this_function_period_timer_p);
	Update_User_Timer_Cnt(&st_this_function_period_timer_p);
	if(st_this_function_period_timer_p.ul_timer_cnt > GIMBAL_DEBUG_FEEDBACK_PERIOD_MS)  
	{	
		Reset_User_Timer(&st_this_function_period_timer_p);
		if(SET == Feedback_Odd_Flag)
		{
			uc_fdb_cmd_data_array_p[0] = 0x56;
			uc_fdb_cmd_data_array_p[1] = 0x2C;
			/*校准过程种传递原始数据，校准完成后传递校准后数据*/
			if( (uc_gimbal_cal_acc_drift_step >= 0x02)&&(uc_gimbal_cal_acc_drift_step <= 0x07) )
			{
				uc_fdb_cmd_data_array_p[2]=(uint8_t)(((int16_t)(f_sensor_acc_raw_data_array[GIMBAL_ACC_X_DATA_INDEX]*100))>>8);
				uc_fdb_cmd_data_array_p[3]=(uint8_t)((int16_t)(f_sensor_acc_raw_data_array[GIMBAL_ACC_X_DATA_INDEX]*100));	
				uc_fdb_cmd_data_array_p[4]=(uint8_t)(((int16_t)(f_sensor_acc_raw_data_array[GIMBAL_ACC_Y_DATA_INDEX]*100))>>8);
				uc_fdb_cmd_data_array_p[5]=(uint8_t)((int16_t)(f_sensor_acc_raw_data_array[GIMBAL_ACC_Y_DATA_INDEX]*100));	
				uc_fdb_cmd_data_array_p[6]=(uint8_t)(((int16_t)(f_sensor_acc_raw_data_array[GIMBAL_ACC_Z_DATA_INDEX]*100))>>8);	
				uc_fdb_cmd_data_array_p[7]=(uint8_t)((int16_t)(f_sensor_acc_raw_data_array[GIMBAL_ACC_Z_DATA_INDEX]*100));
			}
			else
			{
				uc_fdb_cmd_data_array_p[2]=(uint8_t)(((int16_t)(f_gimbal_acc_data_array[0]*100))>>8);
				uc_fdb_cmd_data_array_p[3]=(uint8_t)((int16_t)(f_gimbal_acc_data_array[0]*100));	
				uc_fdb_cmd_data_array_p[4]=(uint8_t)(((int16_t)(f_gimbal_acc_data_array[1]*100))>>8);
				uc_fdb_cmd_data_array_p[5]=(uint8_t)((int16_t)(f_gimbal_acc_data_array[1]*100));	
				uc_fdb_cmd_data_array_p[6]=(uint8_t)(((int16_t)(f_gimbal_acc_data_array[2]*100))>>8);	
				uc_fdb_cmd_data_array_p[7]=(uint8_t)((int16_t)(f_gimbal_acc_data_array[2]*100));
			}
			
			
			if(SET == en_gimbal_cal_gyro_drift_flag)
			{
				uc_fdb_cmd_data_array_p[8]=(uint8_t)(((int16_t)(f_sensor_gyro_raw_data_array[GIMBAL_GYRO_X_DATA_INDEX]*100))>>8);
				uc_fdb_cmd_data_array_p[9]=(uint8_t)((int16_t)(f_sensor_gyro_raw_data_array[GIMBAL_GYRO_X_DATA_INDEX]*100));	
				uc_fdb_cmd_data_array_p[10]=(uint8_t)(((int16_t)(f_sensor_gyro_raw_data_array[GIMBAL_GYRO_Y_DATA_INDEX]*100))>>8);
				uc_fdb_cmd_data_array_p[11]=(uint8_t)((int16_t)(f_sensor_gyro_raw_data_array[GIMBAL_GYRO_Y_DATA_INDEX]*100));	
				uc_fdb_cmd_data_array_p[12]=(uint8_t)(((int16_t)(f_sensor_gyro_raw_data_array[GIMBAL_GYRO_Z_DATA_INDEX]*100))>>8);	
				uc_fdb_cmd_data_array_p[13]=(uint8_t)((int16_t)(f_sensor_gyro_raw_data_array[GIMBAL_GYRO_Z_DATA_INDEX]*100));
			}
			else
			{
				uc_fdb_cmd_data_array_p[8]=(uint8_t)(((int16_t)(f_gimbal_gyro_data_array[0]*100))>>8);
				uc_fdb_cmd_data_array_p[9]=(uint8_t)((int16_t)(f_gimbal_gyro_data_array[0]*100));	
				uc_fdb_cmd_data_array_p[10]=(uint8_t)(((int16_t)(f_gimbal_gyro_data_array[1]*100))>>8);
				uc_fdb_cmd_data_array_p[11]=(uint8_t)((int16_t)(f_gimbal_gyro_data_array[1]*100));	
				uc_fdb_cmd_data_array_p[12]=(uint8_t)(((int16_t)(f_gimbal_gyro_data_array[2]*100))>>8);	
				uc_fdb_cmd_data_array_p[13]=(uint8_t)((int16_t)(f_gimbal_gyro_data_array[2]*100));
			}
			
			Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
		}
		else
		{		
			Get_Motor_Frame_Angle(uc_recive_motor_frame_angle);
			
			uc_fdb_cmd_data_array_p[0] = 0x56;
			uc_fdb_cmd_data_array_p[1] = 0x3A;
			uc_fdb_cmd_data_array_p[2]=(uint8_t)(((int16_t)(motor_x_pos_data))>>8);
			uc_fdb_cmd_data_array_p[3]=(uint8_t)((int16_t)(motor_x_pos_data));	
			uc_fdb_cmd_data_array_p[4]=(uint8_t)(((int16_t)(motor_y_pos_data))>>8);
			uc_fdb_cmd_data_array_p[5]=(uint8_t)((int16_t)(motor_y_pos_data));	
			uc_fdb_cmd_data_array_p[6]=(uint8_t)(((int16_t)(motor_z_pos_data))>>8);	
			uc_fdb_cmd_data_array_p[7]=(uint8_t)((int16_t)(motor_z_pos_data));
			
			uc_fdb_cmd_data_array_p[8]=(uint8_t)(0x00);
			uc_fdb_cmd_data_array_p[9]=(uint8_t)(0x00);	
			uc_fdb_cmd_data_array_p[10]=(uint8_t)(0x00);
			uc_fdb_cmd_data_array_p[11]=(uint8_t)(0x00);	
			Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);	
		}
		
		Feedback_Odd_Flag = !Feedback_Odd_Flag;
	}
}



/**
  * @brief 	void	Process_Save_Roll_Ref_Cmd(uint8_t *cmd_data_array_p)
	* @note	 	保存横滚角参考值
  */
//void	Process_Save_Roll_Ref_Cmd(uint8_t *cmd_data_array_p)
//{
//	uint8_t	uc_fdb_cmd_data_array_p[2];
//	
//	if(HORIZONTAL == en_camera_viewer_mode)
//	{
//		if( (f_euler_array[1]>-20)&&(f_euler_array[1]<20) )
//		{
//			f_earth_y_pos_pid_ref_offset_in_horizontal_mode = f_euler_array[1];			
//		}
//		else
//		{
//			f_earth_y_pos_pid_ref_offset_in_horizontal_mode = 0;
//		}
//		en_earth_y_pos_pid_ref_offset_in_horizontal_mode_cal_flag = SET;
//	}
//	else if(VERTICAL == en_camera_viewer_mode)
//	{
//		if( (f_euler_array[1]>70)&&(f_euler_array[1]<110) )
//		{
//			f_earth_y_pos_pid_ref_offset_in_vertical_mode = f_euler_array[1];
//		}
//		else
//		{
//			f_earth_y_pos_pid_ref_offset_in_vertical_mode = 90;
//		}
//		en_earth_y_pos_pid_ref_offset_in_vertical_mode_cal_flag = SET;
//	}
//	
//	Save_Gimbal_Config_Data();
//	
//	uc_fdb_cmd_data_array_p[0] = 0x56;
//	uc_fdb_cmd_data_array_p[1] = 0x80;
//	
//	Pack_And_Send_Cmd(FEEDBACK_CMD_TXBUF,uc_fdb_cmd_data_array_p,MODULE_ADD_BYTE);
//}




//
/**
  * @brief 	void	Process_Set_Spd_Ratio_Cmd(uint8_t *cmd_data_array_p)
	* @note	 	保存横滚角参考值
  */
/**
  * @brief 	void	Process_Ahrs_Query_Config_Info_Cmd(uint8_t *cmd_data_array_p)
	* @note	 	此函数用来响应查询配置信息
  */
